
Функция НайтиИлиСоздатьПользователя(ПользовательИБ, Параметры) Экспорт
	ПользовательСсылка = НайтиПоНаименованию(ПользовательИБ.Имя);
	Если ПользовательСсылка.Пустая() Тогда
		ПользовательОбъект = СоздатьЭлемент();
		ПользовательОбъект.Наименование = ПользовательИБ.Имя;
		ПользовательОбъект.ПолноеИмя 	= ПользовательИБ.ПолноеИмя;

		ПользовательОбъект.ЗаполнитьНаборРолей(ПользовательИБ);

		ПользовательОбъект.Записать();

		ПользовательСсылка = ПользовательОбъект.Ссылка;
	КонецЕсли;
	
	НоваяСтруктура = Новый Структура();
	НоваяСтруктура.Вставить("ИмяКлюча", "Имя1");
	
	Возврат ПользовательСсылка;

КонецФункции