
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

		Перем1 = 0;
		Перем1 = Перем1+1;
		
		Перем2= 0;
		Перем3 = 10;
		
		Если НЕ ЭтоНовый() Тогда
			ТЗ = НовыйТЗ(Перем2, Ссылка);
		КонецЕсли;			
//		а = 1/0;
		Для Шаг = 1 по 100 Цикл
			Перем2 = Перем2 +1 ;
			Перем3 = 100;	
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Перем2 = Перем2;

		КонецЦикла;
		
		ТЗ.ЗаполнитьЗначения(Ссылка, "Ссылка");

				
КонецПроцедуры

Функция НовыйТЗ(Перем2, Ссылка)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Поставщики.Ссылка,
	|	&Перем2
	|ИЗ
	|	Справочник.Поставщики КАК Поставщики
	|ГДЕ
	|	Поставщики.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Перем2", Перем2);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции	